tap "homebrew/bundle"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GNU debugger for arm-none-eabi cross development
brew "arm-none-eabi-gdb"
# GNU binary tools for native development
brew "binutils"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Tool for managing OCI containers and pods
brew "podman"
# Collection of on chip debugging tools to communicate with microchips
brew "probe-rs-tools"
# Rust toolchain installer
brew "rustup"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compare files and folders
cask "beyond-compare"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# GUI companion app for Homebrew
cask "cork"
# Matrix collaboration client
cask "element"
cask "font-fira-code-nerd-font"
# Music book & backing tracks
cask "ireal-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
